# Database Programming in Python

#### General structure of python code that makes use of a database:

In [1]:
import sqlite3

# open a database connection
conn = sqlite3.connect('test.sqlite');

# get a cursor, which will be used to execute SQL commands and to fetch the results.
cur = conn.cursor();

# ...
# Run SQL statements using cur.execute( ... )
# ...

#make sure to commit(), so that your changes are saved.
conn.commit();

# When you are done, be sure to close so the connection is "released"
conn.close();

### In a "production" setting:
* You should enclose your connection and queries in "try ... except ...", so you handle any errors they raise.
* You should use transactions to group related queries.
* In a concurrent environment (e.g., web service) you should use locks to protect critical operations.

# Create/drop table

In [3]:
conn = sqlite3.connect('test.sqlite');
cur = conn.cursor();

# To drop a table:
conn.execute("DROP TABLE IF EXISTS students")

conn.execute("""CREATE TABLE   IF NOT EXISTS   students (
id INTEGER PRIMARY KEY,
name VARCHAR(30), 
birth DATE, 
gpa FLOAT, 
grad INTEGER);
""");
conn.commit(); #make sure to commit() so your changes are saved.
# You should normally close when you are done with the connection, but I will not
#  close the connection here, so I can keep using it in the rest of this tutorial.


# I won't drop it here, because I will use the students table in the rest of this tutorial.

# Insert/Delete

In [4]:
conn.execute("INSERT INTO students(name, birth, gpa, grad) \
    VALUES ('Anderson', '1987-10-22', 3.9, 2009);");
conn.execute("INSERT INTO students(name, birth, gpa, grad) \
     VALUES ('Jones', '1990-4-16', 2.4, 2012);");
conn.execute("INSERT INTO students(name, birth, gpa, grad) \
    VALUES ('Hernandez', '1989-8-12', 3.1, 2011);");
conn.execute("INSERT INTO students(name, birth, gpa, grad) \
    VALUES ('Chen', '1990-2-4', 3.2, 2011);");

# You don't have to specify all of the fields:
conn.execute("INSERT INTO students(name)  VALUES ('Ahmet');");


# To delete all the rows:
# conn.execute("DELETE FROM students;");
# again, commented out, because I will keep using the students table.

conn.commit();

# Select Queries
3 main elements:
* What you want (SELECT ...)
* Where it is found (FROM ...)
* How you want it filtered (WHERE ...)

In [5]:
# Retrieve entire contents of a table
# Note that you need to use cursor.execute() rather than connection.execute(), because you want to
# fetch results. When you don't need to fetch results (i.e., CREATE/DROP/INSERT/DELETE/UPDATE),
#  you can use connection.execute()
cur.execute("SELECT * FROM students;");
rows = cur.fetchall()
for row in rows: print(row)

(1, 'Anderson', '1987-10-22', 3.9, 2009)
(2, 'Jones', '1990-4-16', 2.4, 2012)
(3, 'Hernandez', '1989-8-12', 3.1, 2011)
(4, 'Chen', '1990-2-4', 3.2, 2011)
(5, 'Ahmet', None, None, None)

### Using pandas for display

In [6]:
# The output doesn't look pretty. Let's make it look prettier by converting it into a pandas data structure
cur.execute("SELECT * FROM students;");
rows=cur.fetchall();
from pandas import DataFrame
df = DataFrame(rows)
df.columns = [x[0] for x in cur.description]
display(df) #display() is ipython-specific. In non-ipython script, you can use print(df)

   id       name       birth  gpa    grad
0   1   Anderson  1987-10-22  3.9  2009.0
1   2      Jones   1990-4-16  2.4  2012.0
2   3  Hernandez   1989-8-12  3.1  2011.0
3   4       Chen    1990-2-4  3.2  2011.0
4   5      Ahmet        None  NaN     NaN

### Defining myselect() to make query & display easier

In [7]:
# we'll be selecting and printing a lot, so let's define a function for it.
from pandas import DataFrame
def myselect(sql):
    cur.execute(sql);
    rows=cur.fetchall();
    if len(rows)==0:
        print('No results returned for SQL query.');
    else:
        df = DataFrame(rows)
        df.columns = [x[0] for x in cur.description]
        display(df) #display() is ipython-specific. In non-ipython script, you can use print(df)

In [8]:
# Show just a few columns from a table:
# Retrieve entire contents of a table
myselect(" SELECT name, gpa FROM students; ")

        name  gpa
0   Anderson  3.9
1      Jones  2.4
2  Hernandez  3.1
3       Chen  3.2
4      Ahmet  NaN

In [9]:
# Filtering: only get a subset of the rows:
myselect(" SELECT name, gpa   FROM students   WHERE gpa > 3.0; ")

        name  gpa
0   Anderson  3.9
1  Hernandez  3.1
2       Chen  3.2

In [10]:
# Sorting:
myselect(" SELECT gpa, name, grad FROM students WHERE gpa > 3.0  ORDER BY gpa DESC; ")

   gpa       name  grad
0  3.9   Anderson  2009
1  3.2       Chen  2011
2  3.1  Hernandez  2011

In [11]:
# Limiting: only get a certain number of rows:
myselect(" SELECT name, gpa FROM students LIMIT 0,2; ")

       name  gpa
0  Anderson  3.9
1     Jones  2.4

# Update/Delete

In [12]:
print('Before the update:')
myselect("SELECT * FROM students WHERE id=2")

# Update:
conn.execute("""
UPDATE students
    SET gpa = 2.6, grad = 2013
    WHERE id = 2;
""");
conn.commit();

print('After the update:')
myselect("SELECT * FROM students WHERE id=2")

Before the update:

   id   name      birth  gpa  grad
0   2  Jones  1990-4-16  2.4  2012

After the update:

   id   name      birth  gpa  grad
0   2  Jones  1990-4-16  2.6  2013

In [13]:
print('Before delete:')
myselect("SELECT * FROM students WHERE id=2")

conn.execute("DELETE FROM students WHERE id = 2;")

print('After delete:')
myselect("SELECT * FROM students WHERE id=2")


#Let's add Jones back so future queries can use it again.
conn.execute("INSERT INTO students(id, name, birth, gpa, grad) \
     VALUES (2,'Jones', '1990-4-16', 2.4, 2012);");
conn.commit();

Before delete:

   id   name      birth  gpa  grad
0   2  Jones  1990-4-16  2.6  2013

After delete:
No results returned for SQL query.

# Joins
* Join: a query that merges the contents of 2 or more tables, retrieves information from the merged results.
* Join example: many-to-one relationship
* Students have advisors; add a new table describing faculty.

In [14]:
conn.execute("DROP TABLE IF EXISTS advisors")
conn.execute("""CREATE TABLE advisors (
id INTEGER PRIMARY KEY,
name VARCHAR(30), 
title VARCHAR(30));
""");
conn.execute("INSERT INTO advisors(name,title) VALUES('Fujimura','assocprof');")
conn.execute("INSERT INTO advisors(name,title) VALUES('Bolosky','prof');")
conn.commit()
myselect("SELECT * FROM advisors")

   id      name      title
0   1  Fujimura  assocprof
1   2   Bolosky       prof

In [15]:
# Add new column advisor_id to the students table. This is a foreign key.
conn.execute("ALTER TABLE students ADD COLUMN advisor_id INTEGER")

In [16]:
conn.execute("UPDATE students SET advisor_id=2 WHERE id=1")
conn.execute("UPDATE students SET advisor_id=1 WHERE id=2 OR id=3 OR id=4")
conn.commit();
myselect("SELECT * FROM students")

   id       name       birth  gpa    grad  advisor_id
0   1   Anderson  1987-10-22  3.9  2009.0         2.0
1   2      Jones   1990-4-16  2.4  2012.0         1.0
2   3  Hernandez   1989-8-12  3.1  2011.0         1.0
3   4       Chen    1990-2-4  3.2  2011.0         1.0
4   5      Ahmet        None  NaN     NaN         NaN

In [17]:
# Perform the join query.
# Get the students who are advised by Fujimura. Get their names and GPAs.
myselect("SELECT students.name, students.gpa FROM students, advisors \
    WHERE advisors.name = 'Fujimura' AND advisors.id = students.advisor_id; ")

        name  gpa
0      Jones  2.4
1  Hernandez  3.1
2       Chen  3.2

In [18]:
# You can give short names to the tables to be used within your query.
myselect("SELECT s.name, s.gpa FROM students s, advisors a \
    WHERE a.name = 'Fujimura' AND a.id = s.advisor_id; ")

        name  gpa
0      Jones  2.4
1  Hernandez  3.1
2       Chen  3.2

In [19]:
#You can change the names of the fields that come back as results
myselect("SELECT a.id AS advisorid, a.name AS advisorname,\
s.id AS studentid, s.name AS studentname, s.gpa FROM students s, advisors a \
    WHERE a.name = 'Fujimura' AND a.id = s.advisor_id; ")

   advisorid advisorname  studentid studentname  gpa
0          1    Fujimura          2       Jones  2.4
1          1    Fujimura          3   Hernandez  3.1
2          1    Fujimura          4        Chen  3.2

# Join Example: many-to-many

In [20]:
conn.execute("DROP TABLE IF EXISTS courses");
conn.execute("""CREATE TABLE   IF NOT EXISTS   courses (
id INTEGER PRIMARY KEY,
number VARCHAR(30), 
name VARCHAR(32), 
quarter VARCHAR(32));
"""
);
conn.commit();

In [21]:
conn.execute("INSERT INTO courses(number,name,quarter) VALUES('CS142','Web Stuff','Winter 2009')")
conn.execute("INSERT INTO courses(number,name,quarter) VALUES('ART101','Finger painting','Fall 2008')")
conn.execute("INSERT INTO courses(number,name,quarter) VALUES('ART101','Finger painting','Winter 2009')")
conn.execute("INSERT INTO courses(number,name,quarter) VALUES('PE204','Mud wrestling','Winter 2009')")
conn.commit();
myselect("SELECT * FROM courses");

   id  number             name      quarter
0   1   CS142        Web Stuff  Winter 2009
1   2  ART101  Finger painting    Fall 2008
2   3  ART101  Finger painting  Winter 2009
3   4   PE204    Mud wrestling  Winter 2009

In [22]:
conn.execute("DROP TABLE IF EXISTS courses_students");
conn.execute("""CREATE TABLE   IF NOT EXISTS   courses_students (
course_id INTEGER,
student_id INTEGER,
PRIMARY KEY(course_id,student_id));
"""
);
conn.commit();

In [23]:
conn.execute("INSERT INTO courses_students VALUES(1,1)")
conn.execute("INSERT INTO courses_students VALUES(3,1)")
conn.execute("INSERT INTO courses_students VALUES(4,1)")
conn.execute("INSERT INTO courses_students VALUES(1,2)")
conn.execute("INSERT INTO courses_students VALUES(2,2)")
conn.execute("INSERT INTO courses_students VALUES(1,3)")
conn.execute("INSERT INTO courses_students VALUES(2,4)")
conn.execute("INSERT INTO courses_students VALUES(4,4)")
conn.commit()

In [24]:
# Find all students who have taken ART101. Get student's name
# and the term.
myselect("SELECT c.quarter,s.name \
FROM courses AS c, courses_students AS cs, students AS s \
WHERE number='ART101' AND c.id=cs.course_id AND cs.student_id=s.id")

       quarter      name
0  Winter 2009  Anderson
1    Fall 2008     Jones
2    Fall 2008      Chen

# Useful SQL functions

In [25]:
#Query the number of elements in a table (or any SELECT statement):
myselect('SELECT count(*) AS numberofrows FROM students')

   numberofrows
0             5

In [26]:
#Get the number of elements in a table, and extract it as a python number
cur.execute('SELECT count(*) FROM students').fetchall()[0][0]

5

In [27]:
myselect('SELECT * FROM students WHERE id>2')

   id       name      birth  gpa    grad  advisor_id
0   3  Hernandez  1989-8-12  3.1  2011.0         1.0
1   4       Chen   1990-2-4  3.2  2011.0         1.0
2   5      Ahmet       None  NaN     NaN         NaN

In [28]:
myselect('SELECT name FROM courses')

myselect('SELECT name,count(*) FROM courses GROUP BY name')

              name
0        Web Stuff
1  Finger painting
2  Finger painting
3    Mud wrestling

              name  count(*)
0  Finger painting         2
1    Mud wrestling         1
2        Web Stuff         1

In [29]:
myselect('SELECT distinct(name) FROM courses')

              name
0        Web Stuff
1  Finger painting
2    Mud wrestling

In [3]:
# import ahmet's bmes module that contains useful functions for downloading files from web.
import sys, pathlib
sys.path.append('D:/ahmet/doc/Dropbox/share/bmes.ahmet') #this is only for ahmet's computer.
#if bmes.ahmet is not in your PYTHONPATH and none of the following can locate where you have your bmes.ahmet folder,
#  you will need to hard-code it.
sys.path.append('../bmes.ahmet'); sys.path.append('../../bmes.ahmet');
sys.path.append(str(pathlib.Path.home())+'/Dropbox/bmes.ahmet');

import bmes

In [4]:
# Get Drosophila genes that are localized in nucleus
url='http://amigo2.berkeleybop.org/goose?mirror=bbop&query=SELECT+genep.symbol%0D%0AFROM+term+AS+t%2C+graph_path+as+gp%2C+association+AS+a%2C+gene_product+AS+genep%2C+species+AS+s%0D%0AWHERE%0D%0A++++++++t.name%3D%27nucleus%27%0D%0AAND+t.id%3Dgp.term1_id%0D%0AAND+gp.term2_id+%3D+a.term_id%0D%0AAND+a.gene_product_id+%3D+genep.id%0D%0AAND+s.genus%3D%27Drosophila%27%0D%0AAND+s.species%3D%27melanogaster%27%0D%0AAND+s.id%3Dgenep.species_id&limit=10&format=text'
file='drosophila_nuclear.txt';
bmes.downloadurl(url,file)
with open(file) as f:
    for line in f:
        print(line.strip())

14-3-3epsilon
14-3-3epsilon
14-3-3epsilon
14-3-3zeta
14-3-3zeta
14-3-3zeta
4E-T
AGO1
AGO2
AMPKalpha

In [6]:
# Downloading a gzfile and reading it line-by-line..
gzfile=bmes.downloadfile('http://mirdb.org/download/miRDB_v6.0_prediction_result.txt.gz');
import gzip
i=0;
with gzip.open(gzfile,'rt') as f:
    for line in f:
        parts=line.strip().split("\t")
        print(parts)
        i=i+1;
        if i>=10: break


#conn.execute("INSERT INTO mytable(myfirstcolumn,myseccolumn,mythirdcolumn) VALUES('cfa-let-7a', 'XM_003433204', '61.0957')")

['cfa-miR-1185', 'XM_537211', '59.3438099752']
['cfa-miR-1185', 'XM_536047', '54.527']
['cfa-miR-1185', 'XM_005617022', '55.1716326075']
['cfa-miR-1185', 'XM_014117861', '57.4409058608']
['cfa-miR-1185', 'XM_014107884', '57.1519']
['cfa-miR-1185', 'XM_005626419', '67.0536']
['cfa-miR-1185', 'XM_005618203', '62.64']
['cfa-miR-1185', 'NM_001252367', '58.9597687709186']
['cfa-miR-1185', 'XM_005621885', '78.529415636']
['cfa-miR-1185', 'XM_005622017', '58.8579982864']

In [ ]:
items=['apple','3','red'];

#print('INSERT INTO myfruits(name,weight,color) VALUES (' + items[0] + ', ' + items[1] + ', ' + items[2] + ') ')